const streets =[
  {
    "ru": "Абразивная улица",
    "ua": "Абразивна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Абрикосовая улица",
    "ua": "Абрикосова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Абхазский переулок",
    "ua": "Абхазький провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Авалиани улица",
    "ua": "Аваліяні вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Авангардная улица",
    "ua": "Авангардна вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Авиационная улица",
    "ua": "Авіаційна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Авраменко улица",
    "ua": "Авраменка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Автобусная улица",
    "ua": "Автобусна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Автодоровская улица",
    "ua": "Автодорівська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Автодорожная улица",
    "ua": "Автодорожна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Автозаводская улица",
    "ua": "Автозаводська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Автопарковая улица",
    "ua": "Автопаркова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Автострадная улица",
    "ua": "Автострадна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Аграрный переулок",
    "ua": "Аграрний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Агрономическая улица",
    "ua": "Агрономічна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Аджарская улица",
    "ua": "Аджарська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Адлерская улица",
    "ua": "Адлерська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Адмирала Лазарева улица",
    "ua": "Адмірала Лазарева вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Адмирала Макарова улица",
    "ua": "Адмірала Макарова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Адмирала Нахимова улица",
    "ua": "Адмірала Нахімова вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Адмирала Ушакова улица",
    "ua": "Адмірала Ушакова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Адмиралтейская улица",
    "ua": "Адміралтейська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Адыгейская улица",
    "ua": "Адигейська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ажурная улица",
    "ua": "Ажурна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Азовская улица",
    "ua": "Азовська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Айвазовского улица",
    "ua": "Айвазовського вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Академика Александрова улица",
    "ua": "Академіка Александрова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Академика Веснина улица",
    "ua": "Академіка Весніна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Академика Грекова улица",
    "ua": "Академіка Грекова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Академика Карпинского улица",
    "ua": "Академіка Карпінського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Академика Курчатова улица",
    "ua": "Академіка Курчатова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Академика Павлова улица",
    "ua": "Академіка Павлова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Академика Филатова улица",
    "ua": "Академіка Філатова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Академическая улица",
    "ua": "Академічна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Актюбинская улица",
    "ua": "Актюбінська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Алапаевская улица",
    "ua": "Алапаєвська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Александра Матросова улица",
    "ua": "Олександра Матросова вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Александра Невского улица",
    "ua": "Олександра Невського вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Аллейная улица",
    "ua": "Алейна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Аллейный переулок",
    "ua": "Алейний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Алма-Атинская улица",
    "ua": "Алма-Атинська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Алмазная улица",
    "ua": "Алмазна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Алтайская улица",
    "ua": "Алтайська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Алуштинская улица",
    "ua": "Алуштинська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Алюминиевая улица",
    "ua": "Алюмінієва вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Альпийская улица",
    "ua": "Альпійська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Аматорская улица",
    "ua": "Аматорська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Амбулаторная улица",
    "ua": "Амбулаторна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Амурская улица",
    "ua": "Амурська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Анадырский переулок",
    "ua": "Анадирський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Анапская улица",
    "ua": "Анапська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ангарная улица",
    "ua": "Ангарна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Базарная улица",
    "ua": "Базарна вулиця",
    "district": "Александровский район",
    "old": "Анголенко улица"
  },
  {
    "ru": "Адреевский переулок",
    "ua": "Андріївський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Михаила Коцюбинского улица",
    "ua": "Михайла Коцюбинського вулиця",
    "district": "Днепровский район",
    "old": "Андросова улица"
  },
  {
    "ru": "Петра Ребро улица",
    "ua": "Петра Ребра вулиця",
    "district": "Днепровский район",
    "old": "Анри Барбюса улица"
  },
  {
    "ru": "Антарктическая улица",
    "ua": "Антарктична вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Антенная улица",
    "ua": "Антенна вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Апрельский переулок",
    "ua": "Квітневий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Аптечная улица",
    "ua": "Аптечна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Аравийский переулок",
    "ua": "Аравійський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Аральская улица",
    "ua": "Аральська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Арбатский переулок",
    "ua": "Арбатський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Арбузова улица",
    "ua": "Арбузова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Арктичная улица",
    "ua": "Арктична вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Армавирская улица",
    "ua": "Армавірська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Армейский переулок",
    "ua": "Армійський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Арочная улица",
    "ua": "Арочна вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Арсенальная улица",
    "ua": "Арсенальна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Артековский переулок",
    "ua": "Артеківський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Святого Николая улица",
    "ua": "Святого Миколая вулиця",
    "district": "Александровский район",
    "old": "Артема улица"
  },
  {
    "ru": "Артиллеристов улица",
    "ua": "Артилеристів вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Архангельский переулок",
    "ua": "Архангельський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Архитектурная улица",
    "ua": "Архітектурна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Астраханская улица",
    "ua": "Астраханська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Астрономический переулок",
    "ua": "Астрономічний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Аэродромная улица",
    "ua": "Аеродромна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Базовая улица",
    "ua": "Базова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мальв улица",
    "ua": "Мальв вулиця",
    "district": "Шевченковский район",
    "old": "Бабушкина улица"
  },
  {
    "ru": "Багратиона улица",
    "ua": "Багратіона вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Байды улица",
    "ua": "Байди вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бакинский переулок",
    "ua": "Бакинський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ивана Сирко улица",
    "ua": "Івана Сірка вулиця",
    "district": "Бакинский переулок (Запорожье)",
    "old": "Бакинских Комиссаров улица"
  },
  {
    "ru": "Балканский переулок",
    "ua": "Балканський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Балка «Поповка» улица",
    "ua": "Балка «Попівка» вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Балковая улица",
    "ua": "Балкова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Балтийская улица",
    "ua": "Балтійська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Банковская улица",
    "ua": "Банківська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Баранова улица",
    "ua": "Баранова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Барнаульский переулок",
    "ua": "Барнаульський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Баррикадная улица",
    "ua": "Барикадна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Бассейная улица",
    "ua": "Басейна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бастионный переулок",
    "ua": "Бастіонний провулок",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Батайская улица",
    "ua": "Батайська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Батарейная улица",
    "ua": "Батарейна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Батумская улица",
    "ua": "Батумська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Речная улица",
    "ua": "Річкова вулиця",
    "district": "Коммунарский район",
    "old": "Баумана улица"
  },
  {
    "ru": "Бахчисарайский переулок",
    "ua": "Бахчисарайський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Безымянный переулок",
    "ua": "Безіменний провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Белгородский переулок",
    "ua": "Білгородський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Белинского улица",
    "ua": "Бєлінського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Белогорская улица",
    "ua": "Білогорська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Белокопытова улица",
    "ua": "Бєлокопитова вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Беломорская улица",
    "ua": "Біломорська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Белорусская улица",
    "ua": "Білоруська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Бельфорский бульвар",
    "ua": "Бельфорський бульвар",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бердянский переулок",
    "ua": "Бердянський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Береговая улица",
    "ua": "Берегова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бережки улица",
    "ua": "Бережки вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Березовый переулок",
    "ua": "Березовий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Беринга переулок",
    "ua": "Беринга провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Бестужева улица",
    "ua": "Бестужева вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бетонная улица",
    "ua": "Бетонна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Бетховена улица",
    "ua": "Бетховена вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бирюзова улица",
    "ua": "Бірюзова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Бирюсинский переулок",
    "ua": "Бірюсінський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Кошевая улица",
    "ua": "Кошова вулиця",
    "district": "Днепровский район",
    "old": "Благоева улица"
  },
  {
    "ru": "Ближний переулок",
    "ua": "Ближній провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дубовая улица",
    "ua": "Дубова вулиця",
    "district": "Днепровский район",
    "old": "Блюхера улица"
  },
  {
    "ru": "Богдана Хмельницкого улица",
    "ua": "Богдана Хмельницького вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Боевая улица",
    "ua": "Бойова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Василия Диденко улица",
    "ua": "Василя Діденка вулиця",
    "district": "Шевченковский район",
    "old": "Боженко улица"
  },
  {
    "ru": "Байконуровская улица",
    "ua": "Байконурівська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Бодянского улица",
    "ua": "Бодянського вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Болотникова улица",
    "ua": "Болотнікова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Больничная улица",
    "ua": "Лікарняна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Борисоглебская улица",
    "ua": "Борісоглібська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Бородинская улица",
    "ua": "Бородінська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Борьбы улица",
    "ua": "Боротьби вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Ботаническая улица",
    "ua": "Ботанічна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Бочарова улица",
    "ua": "Бочарова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Братский переулок",
    "ua": "Братський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Братская улица",
    "ua": "Братська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Брестский переулок",
    "ua": "Брестський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Бродского улица",
    "ua": "Бродського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Броневая улица",
    "ua": "Броньова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Броненосца «Потёмкина» улица",
    "ua": "Броненосця «Потьомкін» вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Брюллова улица",
    "ua": "Брюллова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Брянская улица",
    "ua": "Брянська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Бугский переулок",
    "ua": "Бузький провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Будапештский переулок",
    "ua": "Будапештський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Светлая улица",
    "ua": "Світла вулиця",
    "district": "Хортицкий район",
    "old": "Будённого улица"
  },
  {
    "ru": "Будивельная улица",
    "ua": "Будівельна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Буковинский переулок",
    "ua": "Буковинський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Булавина улица",
    "ua": "Булавіна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бульварная улица",
    "ua": "Бульварна вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Бурденко улица",
    "ua": "Бурденка вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Бутырский переулок",
    "ua": "Бутирський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Буревестника улица",
    "ua": "Буревісника вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Былкина улица",
    "ua": "Билкіна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Вавилова улица",
    "ua": "Вавілова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Вагонная улица",
    "ua": "Вагонна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Важливий переулок",
    "ua": "Важливий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Валдайский переулок",
    "ua": "Валдайський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Валовая улица",
    "ua": "Валова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Вантажний переулок",
    "ua": "Вантажний провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Вапняна улица",
    "ua": "Вапняна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Варшавский переулок",
    "ua": "Варшавський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Василия Пойденко улица",
    "ua": "Василя Пойденка вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Васильева улица",
    "ua": "Васильєва вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Васильевская улица",
    "ua": "Василівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ватутина улица",
    "ua": "Ватутіна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Вахтенная улица",
    "ua": "Вахтова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Венский переулок",
    "ua": "Віденський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вербовая улица",
    "ua": "Вербова вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Вересаева улица",
    "ua": "Вересаєва вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Верещагина улица",
    "ua": "Верещагіна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Верный переулок",
    "ua": "Вірний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Верхняя улица",
    "ua": "Верхня вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Верхоянская улица",
    "ua": "Верхоянська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Весёлая улица",
    "ua": "Весела вулиця",
    "district": "п",
    "old": ""
  },
  {
    "ru": "Веснина Академика улица",
    "ua": "Весніна Академіка вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ветеранов переулок",
    "ua": "Ветеранів вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ветреная улица",
    "ua": "Вітряна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Вечерний переулок",
    "ua": "Вечірній провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Взлётный переулок",
    "ua": "Злітний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Видминна улица",
    "ua": "Відмінна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Пантелеймона Кулиша улица",
    "ua": "Пантелеймона Куліша вулиця",
    "district": "Днепровский район",
    "old": "Вильгельма Пика улица"
  },
  {
    "ru": "Винницкая улица",
    "ua": "Вінницька вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Виноградная улица",
    "ua": "Виноградна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Винтера бульвар",
    "ua": "Вінтера бульвар",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Виражная улица",
    "ua": "Віражна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вишнёвая улица",
    "ua": "Вишнева вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Вишневского улица",
    "ua": "Вишневського вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Владивостокская улица",
    "ua": "Владивостоцька вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Владимирская улица",
    "ua": "Володимирська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Внуковский переулок",
    "ua": "Внуківський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Водоворотная улица",
    "ua": "Водовертна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Водозаборная улица",
    "ua": "Водозабірна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Водонапорный переулок",
    "ua": "Водонапірна вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Водопадная улица",
    "ua": "Водоспадна вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Водяная улица",
    "ua": "Водяна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Воинов улица",
    "ua": "Воїнів вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Военкоматская улица",
    "ua": "Військоматська вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Воздушный переулок",
    "ua": "Повітряний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Вознесеновская улица",
    "ua": "Вознесенівська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Вознесенская площадь",
    "ua": "Вознесенівська площа",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Красочная улица",
    "ua": "Барвиста вулиця",
    "district": "Шевченковский район",
    "old": "Войкова улица"
  },
  {
    "ru": "Войсковая улица",
    "ua": "Військова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вокзальная улица",
    "ua": "Вокзальна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Волгоградская улица",
    "ua": "Волгоградська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Волгодонская улица",
    "ua": "Волгодонська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Волжская улица",
    "ua": "Волзька вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вологодский переулок",
    "ua": "Вологодський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Володарская улица",
    "ua": "Володарська вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Волоколамская улица",
    "ua": "Волоколамська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Васильковая улица",
    "ua": "Волошкова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Волховский переулок",
    "ua": "Волховський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Волынская улица",
    "ua": "Волинська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вольный переулок",
    "ua": "Вільний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Вольнянский переулок",
    "ua": "Вільнянський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Вольская улица",
    "ua": "Вольська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вольский переулок",
    "ua": "Вольський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Воркутинский переулок",
    "ua": "Воркутинський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Воронежская улица",
    "ua": "Воронезька вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Воронихина улица",
    "ua": "Вороніхіна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Воронина улица",
    "ua": "Вороніна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Воскресная улица",
    "ua": "Воскресна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Воссоединения Украины улица",
    "ua": "Возз'єднання України вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Восточная улица",
    "ua": "Східна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "8 Марта улица",
    "ua": "8 Березня вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Казацких гетманов улица",
    "ua": "Козацьких гетьманів вулиця",
    "district": "Шевченковский район",
    "old": "улица VIII съезда Советов"
  },
  {
    "ru": "Вроцлавская улица",
    "ua": "Вроцлавська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Встречный переулок",
    "ua": "Зустрічний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вузовская улица",
    "ua": "Вузівська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Выборгская улица",
    "ua": "Виборзька вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Высоковольтная улица",
    "ua": "Високовольтна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Высокогорная улица",
    "ua": "Високогірна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Высотная улица",
    "ua": "Висотна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Выходной переулок",
    "ua": "Вихідний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вятская улица",
    "ua": "Вятська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Водограйная улица",
    "ua": "Водограйна вулиця",
    "district": "Коммунарский район",
    "old": "Гаврилова улица"
  },
  {
    "ru": "Гагарина улица",
    "ua": "Гагаріна вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Газетный переулок",
    "ua": "Газетний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Гаражная улица",
    "ua": "Гаражна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Гарнизонная улица",
    "ua": "Гарнізонна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Гастелло улица",
    "ua": "Гастелла вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Семейный переулок",
    "ua": "Родинний провулок",
    "district": "Днепровский район",
    "old": "Гая переулок"
  },
  {
    "ru": "Гвардейский бульвар",
    "ua": "Гвардійський бульвар",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Генераторная улица",
    "ua": "Генераторна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Генический переулок",
    "ua": "Генічеський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Геологическая улица",
    "ua": "Геологічна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Василия Стуса улица",
    "ua": "Василя Стуса вулиця",
    "district": "Хортицкий район",
    "old": "Георгия Сапожникова улица"
  },
  {
    "ru": "Школьная улица",
    "ua": "Шкільна вулиця",
    "district": "Александровский район",
    "old": "Героев Сталинграда улица"
  },
  {
    "ru": "Героический переулок",
    "ua": "Героїчний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Герцена переулок",
    "ua": "Герцена провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Гималайский переулок",
    "ua": "Гімалайський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Гладкова улица",
    "ua": "Гладкова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Глазунова улица",
    "ua": "Глазунова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Глебова улица",
    "ua": "Глібова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Глинки переулок",
    "ua": "Глінки провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Глиноцементная улица",
    "ua": "Глиноцементна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Глиссерная улица",
    "ua": "Глісерна вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Глубокий переулок",
    "ua": "Глибокий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Гнаровской улица",
    "ua": "Гнаровської вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Гоголя улица",
    "ua": "Гоголя вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Голядкина улица",
    "ua": "Голядкіна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Гомельский переулок",
    "ua": "Гомельський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Гончара улица",
    "ua": "Гончара вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Гончарова улица",
    "ua": "Гончарова вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Горная улица",
    "ua": "Гірська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Городская улица",
    "ua": "Міська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Почтовая улица",
    "ua": "Поштова вулиця",
    "district": "Александровский район",
    "old": "Горького улица"
  },
  {
    "ru": "Господарча улица",
    "ua": "Господарча вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Гостеприимная улица",
    "ua": "Гостинна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Рыночная улица",
    "ua": "Ринкова вулиця",
    "district": "Заводский район",
    "old": "Готвальда улица"
  },
  {
    "ru": "Грабовского улица",
    "ua": "Грабовського вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Гражданская улица",
    "ua": "Громадянська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Гранитная улица",
    "ua": "Гранітна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Гребёнки улица",
    "ua": "Гребінки вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Грибоедова улица",
    "ua": "Грибоєдова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Гризодубовой улица",
    "ua": "Гризодубової вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Гродненская улица",
    "ua": "Гродненська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Грозный переулок",
    "ua": "Грізний провулок",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Громовой улица",
    "ua": "Громової вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Грузинская улица",
    "ua": "Грузинська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Грузовой переулок",
    "ua": "Вантажний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Грушевая улица",
    "ua": "Грушева вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Крепостная улица",
    "ua": "Фортечна вулиця",
    "district": "Шевченковский район, Александровский район",
    "old": "Грязнова улица"
  },
  {
    "ru": "Гурзуфский проулок",
    "ua": "Гурзуфський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Героев 93-й Бригады улица",
    "ua": "Героїв 93-ї Бригади вулиця",
    "district": "Хортицкий район",
    "old": "Гудыменко улица"
  },
  {
    "ru": "29 улица",
    "ua": "29 вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Давыдова улица",
    "ua": "Давидова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дагестанский переулок",
    "ua": "Дагестанський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дальневосточная улица",
    "ua": "Далекосхідна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дальний переулок",
    "ua": "Далекий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дальняя улица",
    "ua": "Далека вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дарвина переулок",
    "ua": "Дарвіна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Дарницкий переулок",
    "ua": "Дарницький провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дачная улица",
    "ua": "Дачна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дачный переулок",
    "ua": "Дачний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "12 Апреля улица",
    "ua": "12 Квітня вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "244 дивизии улица",
    "ua": "244 дивізії вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Двинская улица",
    "ua": "Двінська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Днепрогэс улица",
    "ua": "ДніпроГЕС вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "9 Мая улица",
    "ua": "9 Травня вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "9 Января улица",
    "ua": "9 Січня вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дегтярёва улица",
    "ua": "Дегтярьова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дежнёва улица",
    "ua": "Дежньова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Дивный улица",
    "ua": "Дивна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Декабристов улица",
    "ua": "Декабристів вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Декабрьская улица",
    "ua": "Груднева вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Делегатская улица",
    "ua": "Делегатська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Вольного казачества улица",
    "ua": "Вільного козацтва вулиця",
    "district": "Днепровский район",
    "old": "Демьяна Бедного улица"
  },
  {
    "ru": "Демократическая улица",
    "ua": "Демократична вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Деповская улица",
    "ua": "Деповська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Депутатская улица",
    "ua": "Депутатська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Державина улица",
    "ua": "Державіна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Джамбула улица",
    "ua": "Джамбула вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Александровская улица",
    "ua": "Олександрівська вулиця",
    "district": "Александровский район",
    "old": "Дзержинского улица"
  },
  {
    "ru": "Диагональная улица",
    "ua": "Діагональна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Дивизионная улица",
    "ua": "Дивізіонна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дивногорская улица",
    "ua": "Дивногорська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Дизельная улица",
    "ua": "Дизельна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Порады Алексея улица",
    "ua": "Олексія Поради вулиця",
    "district": "Шевченковский район",
    "old": "Димитрова улица"
  },
  {
    "ru": "Дирижабельная улица",
    "ua": "Дирижабельна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Днепровский переулок",
    "ua": "Дніпровський провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Александра Кузнецова улица",
    "ua": "Олександра Кузнєцова вулиця",
    "district": "Днепровский район",
    "old": "Днепродзержинская улица"
  },
  {
    "ru": "Днепровские Пороги улица",
    "ua": "Дніпровські Пороги вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Днепровские зори улица",
    "ua": "Дніпровські зорі вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дорошенко Петра улица",
    "ua": "Дорошенка Петра вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Павла Захарина улица",
    "ua": "Павла Захаріна вулиця",
    "district": "Александровский район",
    "old": "Днепропетровская улица"
  },
  {
    "ru": "Днепровское шоссе",
    "ua": "Дніпровське шосе",
    "district": "Днепровский район",
    "old": "Днепропетровское шоссе"
  },
  {
    "ru": "Днепрорудный переулок",
    "ua": "Дніпрорудний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Днестровская улица",
    "ua": "Дністровська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Доблестная улица",
    "ua": "Доблесна вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Добробутна улица",
    "ua": "Добробутна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Добролюбова улица",
    "ua": "Добролюбова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Доватора улица",
    "ua": "Доватора вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Довженко улица",
    "ua": "Довженка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Доковская улица",
    "ua": "Доківська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Докторская улица",
    "ua": "Докторська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Докучаева улица",
    "ua": "Докучаєва вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Долинная улица",
    "ua": "Долинна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Доменный переулок",
    "ua": "Домений провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Дом отдыха улица",
    "ua": "Будинок відпочинку вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Донбасская улица",
    "ua": "Донбаська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Донецкая улица",
    "ua": "Донецька вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Донская улица",
    "ua": "Донська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дорогой переулок",
    "ua": "Дорогий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дорожный переулок",
    "ua": "Дорожній провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Достижений улица",
    "ua": "Досягнень вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Малиновая улица",
    "ua": "Малинова вулиця",
    "district": "Александровский район",
    "old": "Дробязко улица"
  },
  {
    "ru": "Студентский парк",
    "ua": "Студентський парк",
    "district": "Александровский район",
    "old": "Дробязко парк"
  },
  {
    "ru": "Дружная улица",
    "ua": "Дружня вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Дружный проезд",
    "ua": "Дружний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дубовый переулок",
    "ua": "Дубовий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дудыкина улица",
    "ua": "Дудикіна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Дунайская улица",
    "ua": "Дунайська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Герхарда Ремпеля улица",
    "ua": "Герхарда Ремпеля вулиця",
    "district": "Днепровский район",
    "old": "Дыбенко улица"
  },
  {
    "ru": "Дом отдыха «Великий Луг» улица",
    "ua": "Будинок відпочинку «Великий Луг» вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Евпаторийская улица",
    "ua": "Євпаторійська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Еднання улица",
    "ua": "Єднання вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Ейская улица",
    "ua": "Єйська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ельницкий переулок",
    "ua": "Єльницький провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Енисейская улица",
    "ua": "Єнісейська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ереванский переулок",
    "ua": "Єреванський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ермака улица",
    "ua": "Єрмака вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ермоловой улица",
    "ua": "Єрмолової вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Есенина улица",
    "ua": "Єсеніна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Жасминная улица",
    "ua": "Жасминна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Железная улица",
    "ua": "Залізна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Железнодорожная улица",
    "ua": "Залізнична вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Федорюка Юрия улица",
    "ua": "Юрія Федорюка вулиця",
    "district": "Шевченковский район",
    "old": "Железнякова улица"
  },
  {
    "ru": "Жемчужный переулок",
    "ua": "Перлинний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Женевский переулок",
    "ua": "Женевський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Живописная улица",
    "ua": "Мальовнича вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Жигулевский переулок",
    "ua": "Жигулівький провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Житомирская улица",
    "ua": "Житомирська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Казака Бабуры улица",
    "ua": "Козака Бабури вулиця",
    "district": "Днепровский район",
    "old": "Жукова улица"
  },
  {
    "ru": "Жуковского улица",
    "ua": "Жуковського вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "27-35 улица",
    "ua": "27 - 35 вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "41 улица",
    "ua": "41 вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Заводская улица",
    "ua": "Заводська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Загородная улица",
    "ua": "Заміська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Загорская улица",
    "ua": "Загорська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Василия Сергиенко улица",
    "ua": "Василя Сергієнка вулиця",
    "district": "Хортицкий район",
    "old": "Заднепровская улица"
  },
  {
    "ru": "Закарпатская улица",
    "ua": "Закарпатська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Замкнутая улица",
    "ua": "Замкнена вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Заньковецкой улица",
    "ua": "Заньковецької вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Заозерная улица",
    "ua": "Заозерна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Западная улица",
    "ua": "Західна вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Заполярная улица",
    "ua": "Заполярна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Запорожская улица",
    "ua": "Запорізька вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Запорожсталевская улица",
    "ua": "Запоріжсталівська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Заречная улица",
    "ua": "Зарічна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Заречный переулок",
    "ua": "Зарічний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "«Зоря» переулок",
    "ua": "«Зоря» провулок",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Заслонова Константина улица",
    "ua": "Заслонова Костянтина вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "3ачиняева улица",
    "ua": "Зачиняєва вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "3вёздный переулок",
    "ua": "Зоряний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Звенигородская улица",
    "ua": "Звенигородська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "3ейская улица",
    "ua": "Зейська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Зелёная улица",
    "ua": "Зелена вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Зеленогорская улица",
    "ua": "Зеленогірська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Зеленодольская улица",
    "ua": "Зеленодольська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Зелёный переулок",
    "ua": "Зелений провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Зелинского улица",
    "ua": "Зелінського вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Зенитный переулок",
    "ua": "Зенітний провулок",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Зерновая улица",
    "ua": "Зернова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Зерновой переулок",
    "ua": "Зерновий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Зестафонская улица",
    "ua": "Зестафонська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Зимняя улица",
    "ua": "Зимова вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Знаменская улица",
    "ua": "Знам'янська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Знаменский переулок",
    "ua": "Знам'янський провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Зои Космодемьянской улица",
    "ua": "Зої Космодем'янської вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Зорге улица",
    "ua": "Зорге вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ивана Богуна улица",
    "ua": "Івана Богуна вулиця",
    "district": "Коммунарский район, Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ивана Сирко улица",
    "ua": "Івана Сірка вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Иванова улица",
    "ua": "Іванова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ивановская улица",
    "ua": "Іванівська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ижевский переулок",
    "ua": "Іжевський провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Измаильская улица",
    "ua": "Ізмаїльська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Благовещенская улица",
    "ua": "Благовіщенська вулиця",
    "district": "Александровский район",
    "old": "Ильича улица"
  },
  {
    "ru": "Ингульский улица",
    "ua": "Інгульська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Индустриальная улица",
    "ua": "Індустріальна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Инженерная площадь",
    "ua": "Інженерна площа",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Инженерная улица",
    "ua": "Інженерна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Институтская улица",
    "ua": "Інститутська вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Инструментальная улица",
    "ua": "Інструментальна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Интернациональная улица",
    "ua": "Інтернаціональна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Иркутская улица",
    "ua": "Іркутська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Иртышская улица",
    "ua": "Іртишська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Искры улица",
    "ua": "Іскри вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Истомина улица",
    "ua": "Істоміна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Испытателей улица",
    "ua": "Випробувачів вулиця",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Историческая улица",
    "ua": "Історична вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Кабардинская улица",
    "ua": "Кабардинська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кабельный переулок",
    "ua": "Кабельний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кавалерийский переулок",
    "ua": "Кавалерійський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кавказский переулок",
    "ua": "Кавказький провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Кадровый переулок",
    "ua": "Кадровий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Казанский переулок",
    "ua": "Казанський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Казачья улица",
    "ua": "Козача вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Казённый переулок",
    "ua": "Казенний провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Казковый улица",
    "ua": "Казковий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Калибровая улица",
    "ua": "Каліброва вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Святовладимирская улица",
    "ua": "Святоволодимирівська вулиця",
    "district": "Коммунарский район",
    "old": "Калинина улица"
  },
  {
    "ru": "Ивана Бабака улица",
    "ua": "Івана Бабака вулиця",
    "district": "Вознесеновский район",
    "old": "Калининградская улица"
  },
  {
    "ru": "Калиновская улица",
    "ua": "Калинівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Калнышевского улица",
    "ua": "Калнишевського вулиця",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Калужская улица",
    "ua": "Калузька вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Каменный переулок",
    "ua": "Кам'яний провулок",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Каменогорская улица",
    "ua": "Кам'яногірська вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Каменская улица",
    "ua": "Кам'янська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Каменско-Днепровская улица",
    "ua": "Кам'янсько-Дніпровська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Камнедробильная улица",
    "ua": "Кам'яноподрібнювальна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Камская улица",
    "ua": "Камська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Камчатский переулок",
    "ua": "Камчатська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Канатный переулок",
    "ua": "Канатний провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Каневская улица",
    "ua": "Канівська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Капустяная улица",
    "ua": "Капустяна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Карбышева улица",
    "ua": "Карбишева вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Карельский переулок",
    "ua": "Карельський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Григория Чечета улица",
    "ua": "Григорія Чечета вулиця",
    "district": "Шевченковский район",
    "old": "Карла Либкнехта улица"
  },
  {
    "ru": "Трансформаторщиков улица",
    "ua": "Трансформаторників вулиця",
    "district": "Днепровский район",
    "old": "Карла Маркса улица"
  },
  {
    "ru": "Кармелюка улица",
    "ua": "Кармалюка вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Карпенко-Карого улица",
    "ua": "Карпенко-Карого вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Карьерная улица",
    "ua": "Кар'єрна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Каспийская улица",
    "ua": "Каспійська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Каховская улица",
    "ua": "Каховська вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Качалова улица",
    "ua": "Качалова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Каширский переулок",
    "ua": "Каширський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Каштановая улица",
    "ua": "Каштанова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Квиткова улица",
    "ua": "Квіткова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Квитуча улица",
    "ua": "Квітуча вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Квитучий переулок",
    "ua": "Квітучий провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Кедровая улица",
    "ua": "Кедрова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Кедровый переулок",
    "ua": "Кедровий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Керченская улица",
    "ua": "Керченська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Кибальчича улица",
    "ua": "Кибальчича вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Киевская улица",
    "ua": "Київська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Оздоровительная улица",
    "ua": "Оздоровча вулиця",
    "district": "Коммунарский район",
    "old": "КІМу провулок"
  },
  {
    "ru": "Академика Амосова улица",
    "ua": "Академіка Амосова вулиця",
    "district": "Жовтневый район",
    "old": "Кірова вулиця"
  },
  {
    "ru": "Кировоградская улица",
    "ua": "Кіровоградська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кирпичная улица",
    "ua": "Цегельна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кирпичный переулок",
    "ua": "Цегельний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кирпичного завода улица",
    "ua": "Цегельного заводу вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кишиневская улица",
    "ua": "Кишинівська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Кияшко улица",
    "ua": "Кияшка вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Елизаветы Щедрович улица",
    "ua": "Єлизавети Щедрович вулиця",
    "district": "Вознесеновский район",
    "old": "Клары Цеткин улица"
  },
  {
    "ru": "Клиническая улица",
    "ua": "Клінічна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Клубная улица",
    "ua": "Клубна вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ключевая улица",
    "ua": "Ключова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Книжная улица",
    "ua": "Книжкова вулиця",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Кобзаря улица",
    "ua": "Кобзаря вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ковпака улица",
    "ua": "Ковпака вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Ковровая улица",
    "ua": "Килимова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кожедуба улица",
    "ua": "Кожедуба вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Коксовый переулок",
    "ua": "Коксовий провулок",
    "district": "Вознесеновский район",
    "old": ""
  },
  {
    "ru": "Коксостроительная улица",
    "ua": "Коксобудівельна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Калиновая улица",
    "ua": "Калинова вулиця",
    "district": "Днепровский район",
    "old": "Коллонтай улица"
  },
  {
    "ru": "Чудесный переулок",
    "ua": "Чудовий провулок",
    "district": "Днепровский район",
    "old": "Колхозный переулок"
  },
  {
    "ru": "Кольцова улица",
    "ua": "Кольцова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Колерова улица",
    "ua": "Колерова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Комарова улица",
    "ua": "Комарова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Комбинатская улица",
    "ua": "Комбінатська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Розенталь улица",
    "ua": "Розенталь вулиця",
    "district": "Днепровский район",
    "old": "Коминтерна улица"
  },
  {
    "ru": "Коммунальная улица",
    "ua": "Комунальна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Приходская улица",
    "ua": "Приходська вулиця",
    "district": "Александровский район",
    "old": "Коммунаровская улица"
  },
  {
    "ru": "Компрессорная улица",
    "ua": "Компресорна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Сергея Серикова улица",
    "ua": "Сергія Серікова вулиця",
    "district": "Коммунарский район",
    "old": "Комсомольская улица"
  },
  {
    "ru": "Конденсаторный переулок",
    "ua": "Конденсаторний провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Конечная улица",
    "ua": "Кінцева вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Конечная переулок",
    "ua": "Кінцевий провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Конотопский переулок",
    "ua": "Конотопський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Константина Великого улица",
    "ua": "Костянтина Великого вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Концевой переулок",
    "ua": "Кінцевий провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Кооперативная улица",
    "ua": "Кооперативна вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Фелликса Мовчановского улица",
    "ua": "Фелікса Мовчановського вулиця",
    "district": "Шевченковский район",
    "old": "Копенкина улица"
  },
  {
    "ru": "Корабельный переулок",
    "ua": "Корабельний провулок",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Короткий переулок",
    "ua": "Короткий провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Корчагинская улица",
    "ua": "Корчагінська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Косарева улица",
    "ua": "Косарєва вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Косая улица",
    "ua": "Коса вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Косиора улица",
    "ua": "Косіора вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Космическая улица",
    "ua": "Космічна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Косогорный переулок",
    "ua": "Косогірний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Костюшко переулок",
    "ua": "Костюшка провулок",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Спартака Маковского улица",
    "ua": "Спартака Маковського вулиця",
    "district": "Шевченковский район",
    "old": "Косыгина улица"
  },
  {
    "ru": "Котельникова улица",
    "ua": "Котельникова вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Котельный переулок",
    "ua": "Котельний провулок",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Котляревского улица",
    "ua": "Котляревського вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Млечный путь улица",
    "ua": "Чумацький шлях вулиця",
    "district": "Шевченковский район",
    "old": "Котовского улица"
  },
  {
    "ru": "Кочубея улица",
    "ua": "Кочубея вулиця",
    "district": "Днепровский район",
    "old": ""
  },
  {
    "ru": "Краевая улица",
    "ua": "Крайова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Крайняя улица",
    "ua": "Крайня вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Краматорская улица",
    "ua": "Краматорська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Крамского улица",
    "ua": "Крамського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Частная улица",
    "ua": "Приватна вулиця",
    "district": "Коммунарский район",
    "old": "Красина улица"
  },
  {
    "ru": "Красная улица",
    "ua": "Червона вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Первая литейная улица",
    "ua": "Перша ливарна вулиця",
    "district": "Александровский район",
    "old": "Красногвардейская улица"
  },
  {
    "ru": "Красногорская улица",
    "ua": "Червоногірська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Красносельский переулок",
    "ua": "Червоносільський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Красноградская улица",
    "ua": "Червоноградська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Краснодонская улица",
    "ua": "Краснодонська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Красное Знамя улица",
    "ua": "Червоного Прапора вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Красноярская улица",
    "ua": "Красноярська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Крайняя улица",
    "ua": "Крайня вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Крейсерная улица",
    "ua": "Крейсерна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Кремлевская улица",
    "ua": "Кремлівська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Кремниевый переулок",
    "ua": "Кремнієвий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Кржижановского улица",
    "ua": "Кржижанівського вулиця",
    "district": "Ленинский район",
    "old": "Тіссена вулиця"
  },
  {
    "ru": "Кривоносова улица",
    "ua": "Кривоносова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Криворожская улица",
    "ua": "Криворізька вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Крицевый переулок",
    "ua": "Крицевий провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Кронштадская улица",
    "ua": "Кронштадська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Кропивницкого улица",
    "ua": "Кропивницького вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Круговая улица",
    "ua": "Кругова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Крупской улица",
    "ua": "Крупської вулиця",
    "district": "Коммунарский район",
    "old": "Ветеранська вулиця"
  },
  {
    "ru": "Крутой переулок",
    "ua": "Крутий провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Крутоярская улица",
    "ua": "Крутоярська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Крылова улица",
    "ua": "Крилова вулиця",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Крымский переулок",
    "ua": "Кримський провулок",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Кубинский переулок",
    "ua": "Кубинський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Кубовая улица",
    "ua": "Кубова вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Кузбасский переулок",
    "ua": "Кузбазський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Кузнецкий переулок",
    "ua": "Ковальський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Кузнецова улица",
    "ua": "Кузнецова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кузнечный переулок",
    "ua": "Ковальський провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Кузьмина улица",
    "ua": "Кузьміна вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Игоря Сикорского улица",
    "ua": "Ігоря Сікорського вулиця",
    "district": "Александровский район, Шевченковский район",
    "old": "Куйбышева улица"
  },
  {
    "ru": "Куликовская улица",
    "ua": "Куликівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Культурная улица",
    "ua": "Культурна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Купянский переулок",
    "ua": "Куп'янський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Курганная улица",
    "ua": "Курганна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Курильский переулок",
    "ua": "Курильський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Курортная улица",
    "ua": "Курортна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Курская улица",
    "ua": "Курська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кустанайская улица",
    "ua": "Кустанайська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Кутузова улица",
    "ua": "Кутузова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Кузнечная улица",
    "ua": "Ковальська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Кутузова улица",
    "ua": "Кутузова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Лагерная улица",
    "ua": "Лагерна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ладожская улица",
    "ua": "Ладозька вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Лазаретная улица",
    "ua": "Лазаретна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Лазо улица",
    "ua": "Лазо вулиця",
    "district": "Шевченковский район",
    "old": "Леоніда Приня вулиця"
  },
  {
    "ru": "Ландышевый переулок",
    "ua": "Конваліївський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Лассаля улица",
    "ua": "Лассаля вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Латвийская улица",
    "ua": "Латвійська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Лахтинская улица",
    "ua": "Лахтинська вулиця",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Леваневского проезд",
    "ua": "Леваневського проїзд",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Легендарная улица",
    "ua": "Легендарна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Леженко улица",
    "ua": "Леженка вулиця",
    "district": "Жовтневый район",
    "old": "Затишна вулиця"
  },
  {
    "ru": "Лейтенанта Шмидта улица",
    "ua": "Лейтенанта Шмидта вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Лейтенантская улица",
    "ua": "Лейтенанська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Лекарская улица",
    "ua": "Лікарська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Ленина площадь",
    "ua": "Леніна площадь",
    "district": "Ленинский район",
    "old": "Сагайдачного площа"
  },
  {
    "ru": "Ленина проспект",
    "ua": "Леніна проспект",
    "district": "Коммунарский район, Жовтневый район, Орджоникидзевский район, Ленинский район",
    "old": "Соборний або Козацький, Вознесенівський, Олександрівський"
  },
  {
    "ru": "Ленинградская улица",
    "ua": "Ленінградська вулиця",
    "district": "Коммунарский район",
    "old": "Кам'яна вулиця"
  },
  {
    "ru": "Лениногорская улица",
    "ua": "Леніногорська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Ленская улица",
    "ua": "Ленська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Леонида Жаботинского улица",
    "ua": "Леоніда Жаботинського вулиця",
    "district": "Орджоникидзевский район",
    "old": "ул. Правды[11]"
  },
  {
    "ru": "Леонова улица",
    "ua": "Леонова вулиця",
    "district": "Ленинский район",
    "old": "Шаркова вулиця"
  },
  {
    "ru": "Леонтовича улица",
    "ua": "Леонтовича вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Днепровская улица",
    "ua": "Дніпровська вулиця",
    "district": "Жовтневый район",
    "old": "Леппіка вулиця"
  },
  {
    "ru": "Лермонтова улица",
    "ua": "Лермонтова вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Леси Украинки улица",
    "ua": "Лесі Українки вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Лесная улица",
    "ua": "Лісова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Лётный переулок",
    "ua": "Льотний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Лётная улица",
    "ua": "Льотна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Лизы Чайкиной улица",
    "ua": "Лізи Чайкіної вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Лиманская улица",
    "ua": "Лиманська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Линейная улица",
    "ua": "Лінійна вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Липовецкая улица",
    "ua": "Липовецька вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Лирическая улица",
    "ua": "Лірична вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Лиственный переулок",
    "ua": "Листяний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Листопрокатная улица",
    "ua": "Листопрокатна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Литвинова улица",
    "ua": "Литвинова вулиця",
    "district": "Ленинский район",
    "old": "Валльмана вулиця"
  },
  {
    "ru": "Литейная улица",
    "ua": "Ливарна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Литературная улица",
    "ua": "Літературна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Лихачева улица",
    "ua": "Лихачова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Лобановского Валерия улица",
    "ua": "Лробановського Валерія вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Логинова улица",
    "ua": "Логинова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Лодочная улица",
    "ua": "Човнова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ломаная улица",
    "ua": "Ламана вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Ломоносова переулок",
    "ua": "Ломоносова провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Лоцманский переулок",
    "ua": "Лоцманський провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Луганская улица",
    "ua": "Луганська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Луговая улица",
    "ua": "Лугова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Луначарского улица",
    "ua": "Луначарського вулиця",
    "district": "Коммунарский район",
    "old": "Юних залізничників вулиця"
  },
  {
    "ru": "Луцкий переулок",
    "ua": "Луцький провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Лучевая улица",
    "ua": "Променева вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Лыжная улица",
    "ua": "Лижна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Лысенко переулок",
    "ua": "Лисенка провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Магара улица",
    "ua": "Магара вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Магистральная улица",
    "ua": "Магістральна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Магнитная улица",
    "ua": "Магнітна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Майкопский переулок",
    "ua": "Майкопський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Майская улица",
    "ua": "Травнева вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Макаренко улица",
    "ua": "Макаренка вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Макеевский переулок",
    "ua": "Макіївський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Малахитовая улица",
    "ua": "Малахітова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Малая улица",
    "ua": "Мала вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Малика улица",
    "ua": "Малика вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Малиновского улица",
    "ua": "Малиновського вулиця",
    "district": "Коммунарский район",
    "old": "Адміністративна або Мистецька, Покровська вулиця"
  },
  {
    "ru": "Мануильского улица",
    "ua": "Мануїльського вулиця",
    "district": "Коммунарский район",
    "old": "Зоряна вулиця"
  },
  {
    "ru": "Марата улица",
    "ua": "Марата вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Марганцева улица",
    "ua": "Марганцева вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Мариупольский переулок",
    "ua": "Маріупольський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Марко Вовчок улица",
    "ua": "Марка Вовчка вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Марселя Кашена улица",
    "ua": "Марселя Кашена вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Мартеновская улица",
    "ua": "Мартенівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мартовский переулок",
    "ua": "Березневий провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Маршала Чуйкова улица",
    "ua": "Маршала Чуйкова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Маршала Судца улица",
    "ua": "Маршала Судця вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Маршевая улица",
    "ua": "Маршова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Матросская улица",
    "ua": "Матроська вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Мате Залка улица",
    "ua": "Мате Залка вулиця",
    "district": "Ленинский район",
    "old": "Петра Бузука вулиця"
  },
  {
    "ru": "Машинная улица",
    "ua": "Машинна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Маяковского проспект",
    "ua": "Маяковського проспект",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Медведева улица",
    "ua": "Медведєва вулиця",
    "district": "Ленинский район",
    "old": "Орлова вулиця"
  },
  {
    "ru": "Медична улица",
    "ua": "Медична вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Медная улица",
    "ua": "Мідна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Медовый улица",
    "ua": "Медовий провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Международная улица",
    "ua": "Міжнародна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Межевая улица",
    "ua": "Межова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Мелитопольский переулок",
    "ua": "Мелітопольський провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Мелиоративная улица",
    "ua": "Меліоративна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Мельничный переулок",
    "ua": "Млиновий провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Менделеева улица",
    "ua": "Менделєєва вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Менжинского улица",
    "ua": "Менжинського вулиця",
    "district": "Ленинский район",
    "old": "Олени Теліги вулиця"
  },
  {
    "ru": "Металлистов улица",
    "ua": "Металістів вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Металлургов проспект",
    "ua": "Металургів проспект",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Метеоритный переулок",
    "ua": "Метеоритний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Метрополитеновская улица",
    "ua": "Метрополітенівська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Механическая улица",
    "ua": "Механічна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Мечникова улица",
    "ua": "Мечникова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Миклея улица",
    "ua": "Міклея вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Микояна улица",
    "ua": "Мікона вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Минаева улица",
    "ua": "Мінаєва вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Минеральный переулок",
    "ua": "Мінеральний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Минометная улица",
    "ua": "Мінометна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Минская улица",
    "ua": "Мінська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Мира улица",
    "ua": "Миру вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Миргородская улица",
    "ua": "Миргородська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Мирная улица",
    "ua": "Мирна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Михайлова улица",
    "ua": "Михайлова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Міцна улица",
    "ua": "Міцна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мичурина улица",
    "ua": "Мічуріна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Модельный переулок",
    "ua": "Модельний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Можайская улица",
    "ua": "Можайська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Мозаичный переулок",
    "ua": "Мозаїчний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мокрянская улица",
    "ua": "Мокрянська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Молдавская улица",
    "ua": "Молдавська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Молодёжная улица",
    "ua": "Молодіжна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Молодогвардейская улица",
    "ua": "Молодогвардійська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Молочная улица",
    "ua": "Молочна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мятежный переулок",
    "ua": "Заколотний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Морской переулок",
    "ua": "Морський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Морфлотская улица",
    "ua": "Морфлотська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Москвина улица",
    "ua": "Москвіна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Москворецкая улица",
    "ua": "Москворецька вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Московская улица",
    "ua": "Московська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мостовой переулок",
    "ua": "Мостовий провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Моторный переулок",
    "ua": "Моторний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Моховая улица",
    "ua": "Мохова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мраморный переулок",
    "ua": "Мармуровий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мужайло улица",
    "ua": "Мужайла вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Музейная улица",
    "ua": "Музейна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Музыкальная улица",
    "ua": "Музична вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Муравьева улица",
    "ua": "Муравйова вулиця",
    "district": "Жовтневый район",
    "old": "Зоряна вулиця"
  },
  {
    "ru": "Мурманская улица",
    "ua": "Мурманська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Мусоргского улица",
    "ua": "Мусоргського вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мисливський переулок",
    "ua": "Мисливський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Мытищенский переулок",
    "ua": "Митищінський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Нагнибиды улица",
    "ua": "Нагнибіди вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Набережная улица",
    "ua": "Набережна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Нагорная улица",
    "ua": "Нагірна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Наклонная улица",
    "ua": "Похила вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Наливайко улица",
    "ua": "Наливайка вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Нариманова улица",
    "ua": "Наріманова вулиця",
    "district": "Шевченковский район",
    "old": "Сергія Синенка вулиця"
  },
  {
    "ru": "Народный переулок",
    "ua": "Народний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Насосная улица",
    "ua": "Насосна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Натальевская улица",
    "ua": "Наталіївська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Начальная улица",
    "ua": "Початкова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Невельского переулок",
    "ua": "Невельського провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Невская улица",
    "ua": "Невська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Неженская улица",
    "ua": "Ніжинська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Нежинский переулок",
    "ua": "Ніжинський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Немировича-Данченко улица",
    "ua": "Немировича-Данченка вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Ненецкий переулок",
    "ua": "Ненецький провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Нестерова улица",
    "ua": "Нестерова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Нижегородский переулок",
    "ua": "Нижньогородський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Нижнеднепровская улица",
    "ua": "Нижньодніпровська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Нижний переулок",
    "ua": "Нижній провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Нижняя улица",
    "ua": "Нижня вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Низовой переулок",
    "ua": "Низовий провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Никитина улица",
    "ua": "Нікітіна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Николаевой-Терешковой улица",
    "ua": "Миколаєвої-Терешкової вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Николаевский переулок",
    "ua": "Миколаївський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Николая Краснова улица",
    "ua": "Миколи Краснова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Николая Руднева улица",
    "ua": "Миколи Руднєва вулиця",
    "district": "Ленинский район",
    "old": "Вернадського вулиця"
  },
  {
    "ru": "Никопольская улица",
    "ua": "Нікопольська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Новаторская улица",
    "ua": "Новаторська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Новая улица",
    "ua": "Нова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Новгородская улица",
    "ua": "Новгородська вулиця",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Новогодняя улица",
    "ua": "Новорічна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Новокузнецкая улица",
    "ua": "Новокузнецька вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Новомосковская улица",
    "ua": "Новомосовська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Новороссийская улица",
    "ua": "Новоросійська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Новоселовская улица",
    "ua": "Новоелівська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Новосибирская улица",
    "ua": "Новосибірська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Новочеркасская улица",
    "ua": "Новочеркаська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ногина улица",
    "ua": "Ногіна вулиця",
    "district": "Ленинский район",
    "old": "Ольги Кобилянської вулиця"
  },
  {
    "ru": "Ноябрьский переулок",
    "ua": "Листопадовий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Новостроек улица",
    "ua": "Новобудов вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Норильская улица",
    "ua": "Норильська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Н. Г. Кутузова улица",
    "ua": "Н. Г. Кутузова",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Оборонная улица",
    "ua": "Оборонна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Образцовая улица",
    "ua": "Зразкова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Огарева улица",
    "ua": "Огарьова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Огневой переулок",
    "ua": "Вогневий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Огнеупорная улица",
    "ua": "Вогнетривка вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Огородная улица",
    "ua": "Городня вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Одесская улица",
    "ua": "Одеська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Озерный переулок",
    "ua": "Озерний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Окружная улица",
    "ua": "Окружна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Окская улица",
    "ua": "Окська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Октябрьская улица",
    "ua": "Жовтнева вулиця",
    "district": "Жовтневый район",
    "old": "Гуляйпільська вулиця"
  },
  {
    "ru": "Олега Кошевого улица",
    "ua": "Олега Кошового вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Олеко Дундича улица",
    "ua": "Олеко Дундича вулиця",
    "district": "Заводский район",
    "old": "Лазурна вулиця"
  },
  {
    "ru": "Олимпийская улица",
    "ua": "Олімпійська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Омельченко улица",
    "ua": "Омельченка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Омская улица",
    "ua": "Омська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Онежский переулок",
    "ua": "Онезький провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Оранжерейный переулок",
    "ua": "Оранжерейний провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Оранжерейная улица",
    "ua": "Оранжерейна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Орджоникидзе улица",
    "ua": "Орджонікідзе вулиця",
    "district": "Заводский район",
    "old": "Кічкаська вулиця"
  },
  {
    "ru": "Оренбургская улица",
    "ua": "Оренгбурзька вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ореховская улица",
    "ua": "Оріхівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ореховское шоссе",
    "ua": "Оріхівське шосе",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Ореховский переулок",
    "ua": "Оріхівський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Орликов переулок",
    "ua": "Орликів провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Орловская улица",
    "ua": "Орловська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Оружейный переулок",
    "ua": "Збройовий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Освобожденная улица",
    "ua": "Звільнена вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Осенняя улица",
    "ua": "Осіння вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Осипенко улица",
    "ua": "Осипенка вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Основная улица",
    "ua": "Основна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Осоавиахима улица",
    "ua": "Осоавіахіма вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Остапа Вишни улица",
    "ua": "Остапа Вишні вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Островского улица",
    "ua": "Островського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Отечественный бульвар",
    "ua": "Вітчизняний бульвар",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Открытый переулок",
    "ua": "Відкритий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Отрадный переулок",
    "ua": "Відрадний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Отто Шмидта улица",
    "ua": "Отто Шмідта вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Офицерская улица",
    "ua": "Офіцерська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Очаковская улица",
    "ua": "Очаківська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Павлика Морозова улица",
    "ua": "Павлика морозова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Павлоградская улица",
    "ua": "Павлоградська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Палия переулок",
    "ua": "Палія провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Памирская улица",
    "ua": "Памірська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Памятный переулок",
    "ua": "Пам'ятний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Панаса Мирного улица",
    "ua": "Панаса Мирного вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Панельная улица",
    "ua": "Панельна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Панферова улица",
    "ua": "Панфьорова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Панфиловцев улица",
    "ua": "Панфіловців вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Параллельная улица",
    "ua": "Паралельна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Парамонова улица",
    "ua": "Парамонова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Парашютная улица",
    "ua": "Парашутна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Парижской Коммуны улица",
    "ua": "Паризької Комуни вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Партизанская улица",
    "ua": "Партизанська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Пархоменко улица",
    "ua": "Пархоменка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Паторжинского улица",
    "ua": "Паторжинського вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Патриотическая улица",
    "ua": "Патріотична вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Пензенский переулок",
    "ua": "Пензенський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Первая Московская улица",
    "ua": "Перша Московська вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Первомайская улица",
    "ua": "Першотравнева вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Передаточная улица",
    "ua": "Передатна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Передовая улица",
    "ua": "Передова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Перекопская улица",
    "ua": "Перекопська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Перекопский переулок",
    "ua": "Перекопський провулок",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Переяславский переулок",
    "ua": "Переяславський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Перспективная переулок",
    "ua": "Перспективний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Пестеля улица",
    "ua": "Пестеля вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Песчаная улица",
    "ua": "Піщана вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Петровского улица",
    "ua": "Петровського вулиця",
    "district": "Шевченковский район",
    "old": "Пилипа Орлика вулиця"
  },
  {
    "ru": "Пехотная улица",
    "ua": "Піхотна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Печерский переулок",
    "ua": "Печерький провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Пешеходный переулок",
    "ua": "Пішохідний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Пилотов улица",
    "ua": "Пілотів вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Пионерская улица",
    "ua": "Піонерська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Пионерский проулок",
    "ua": "Піонерський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Пирогова улица",
    "ua": "Пирогова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Писарева переулок",
    "ua": "Писарєва провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Письменная улица",
    "ua": "Письменна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Пищевая улица",
    "ua": "Харчова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Плавневая улица",
    "ua": "Плавнева вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Планерная улица",
    "ua": "Планерна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Плановый переулок",
    "ua": "Плановий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Платова улица",
    "ua": "Платова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Плеханова улица",
    "ua": "Плеханова вулиця",
    "district": "Коммунарский район",
    "old": "Агрономічна вулиця"
  },
  {
    "ru": "Плотинная улица",
    "ua": "Гребельна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Победы улица",
    "ua": "Перемоги вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Подбережная улица",
    "ua": "Підбережна вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Подвойского улица",
    "ua": "Подвойського вулиця",
    "district": "Ленинский район",
    "old": "Веденеєва вулиця"
  },
  {
    "ru": "Подгорная улица",
    "ua": "Підгірна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Подлесная улица",
    "ua": "Підлісна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Подмосковная улица",
    "ua": "Підмосковна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Подпорожняя улица",
    "ua": "Підпоріжна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Подольская улица",
    "ua": "Подільська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Пожарского улица",
    "ua": "Пожарського вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Полевая улица",
    "ua": "Польова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Полесская улица",
    "ua": "Поліська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Полесская улица",
    "ua": "Поліська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Полетаева улица",
    "ua": "Полєтаєва вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Поликлиническая улица",
    "ua": "Поліклінічна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Политехническая улица",
    "ua": "Політехнічна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Политкаторжан улица",
    "ua": "Політкаторжан вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Полковой переулок",
    "ua": "Полковий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Половецкая улица",
    "ua": "Половецька вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Полтавская улица",
    "ua": "Полтавська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Полякова улица",
    "ua": "Полякова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Полярная улица",
    "ua": "Полярна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Понтонный переулок",
    "ua": "Понтонний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Поперечная улица",
    "ua": "Поперечна вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Попова улица",
    "ua": "Попова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Портовая улица",
    "ua": "Портова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Посадочная улица",
    "ua": "Посадочна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Поселковая улица",
    "ua": "Селищна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Постовая улица",
    "ua": "Постова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Потешная улица",
    "ua": "Потішна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Поточная улица",
    "ua": "Поточна вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Почтовый переулок",
    "ua": "Поштовий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Пресненский переулок",
    "ua": "Пресненський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Пржевальского улица",
    "ua": "Пржевальського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Прибалочная улица",
    "ua": "Прибалкова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Прибрежный переулок",
    "ua": "Прибережний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Приволжский переулок",
    "ua": "Приволзький провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Приднепровская улица",
    "ua": "Придніпровська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Придорожный переулок",
    "ua": "Придорожний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Приовражная улица",
    "ua": "Прияружна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Природная улица",
    "ua": "Природна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Приозерная улица",
    "ua": "Приозерна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Причальная улица",
    "ua": "Причальна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Прогрессивная улица",
    "ua": "Прогресивна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Продольная улица",
    "ua": "Продольна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Проездная улица",
    "ua": "Проїзна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Производственная улица",
    "ua": "Виробнича вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Прокатная улица",
    "ua": "Прокатна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Пролетарская улица",
    "ua": "Пролетарська вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Промысловая улица",
    "ua": "Промислова",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Прорезной переулок",
    "ua": "Прорізний провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Профинтерна улица",
    "ua": "Профінтерну вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Профсоюзная улица",
    "ua": "Профспілкова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Профсоюзов площадь",
    "ua": "Профспілок площа",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Прохладный переулок",
    "ua": "Прохолодний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Проходной переулок",
    "ua": "Прохідний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Прудовая улица",
    "ua": "Ставкова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Прямой переулок",
    "ua": "Прямий провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Пугачева улица",
    "ua": "Пугачова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Путейская улица",
    "ua": "Путійська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Пушкина улица",
    "ua": "Пушкіна вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Поэтичный переулок",
    "ua": "Поетичний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "50-летия СССР сквер",
    "ua": "50-річчя СРСР сквер",
    "district": "Орджоникидзевский район",
    "old": "сквер ім. Валентина Яланськогоо"
  },
  {
    "ru": "Рабочая улица",
    "ua": "Робоча вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Радгоспный переулок",
    "ua": "Радгоспний провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Радиаторная улица",
    "ua": "Радіаторна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Радио улица",
    "ua": "Радіо вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Радистов улица",
    "ua": "Радистів вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Радищева улица",
    "ua": "Радіщева вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Радостная улица",
    "ua": "Радісна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Радужная улица",
    "ua": "Райдужна вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Раевского улица",
    "ua": "Раєвського вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ракетная улица",
    "ua": "Ракетна вулиця",
    "district": "Коммунарский район, Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ракушечный переулок",
    "ua": "Черепашковий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Расковой улица",
    "ua": "Раскової вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Рахманинова улица",
    "ua": "Рахманінова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Реактивная улица",
    "ua": "Реактивна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Революционная улица",
    "ua": "Революційна вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Редакционная улица",
    "ua": "Редакційна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Реконструктивная улица",
    "ua": "Реконструктивна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Рекордная улица",
    "ua": "Рекордна вулиця",
    "district": "Ленинский район, Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Рельефная улица",
    "ua": "Рельєфна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Рельсовая улица",
    "ua": "Рейкова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ремесленная улица",
    "ua": "Реміснича вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ремонтная улица",
    "ua": "Ремонтна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Репина улица",
    "ua": "Рєпіна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Республиканская улица",
    "ua": "Республіканська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Реутского переулок",
    "ua": "Реутського провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Речная улица",
    "ua": "Річкова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ржевский переулок",
    "ua": "Ржевський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Рижская улица",
    "ua": "Ризька вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Ровенская улица",
    "ua": "Рівненська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Родниковый переулок",
    "ua": "Джерельний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Розваги улица",
    "ua": "Розваги вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Розы Люксембург улица",
    "ua": "Рози Люксембург вулиця",
    "district": "Шевченковский район",
    "old": "Миколи Хвильового вулиця"
  },
  {
    "ru": "Роскошный переулок",
    "ua": "Розкішний провулок",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Росошанська улица",
    "ua": "Росошанська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Ростовская улица",
    "ua": "Ростовська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Рубана улица",
    "ua": "Рубана вулиця",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Рудный переулок",
    "ua": "Рудний вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Русская улица",
    "ua": "Руська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Руставели улица",
    "ua": "Руставелі вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Рустави улица",
    "ua": "Руставі вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Рылеева улица",
    "ua": "Рилєєва вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Рыльского улица",
    "ua": "Рильського вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Рябиновая улица",
    "ua": "Горобинова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Рязанская улица",
    "ua": "Рязанська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Рясная улица",
    "ua": "Рясна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Садовая улица",
    "ua": "Садова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Садоводство улица",
    "ua": "Садівництва вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Сакко и Ванцетти улица",
    "ua": "Сакко та Ванцетті вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Салавата Юлаева улица",
    "ua": "Салавата Юлаєва вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сальский переулок",
    "ua": "Сальський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Самарская улица",
    "ua": "Самарська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Самотёчный переулок",
    "ua": "Самотічна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Самолётная улица",
    "ua": "Літакова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Самоцветная улица",
    "ua": "Самоцвітна вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Санаторная улица",
    "ua": "Санаторна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Санитарная улица",
    "ua": "Санітарна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Сапёрная улица",
    "ua": "Саперна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Сахалинская улица",
    "ua": "Сахалінська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Свердлова улица",
    "ua": "Свердлова вулиця",
    "district": "Жовтневый район",
    "old": "Покровська вулиця"
  },
  {
    "ru": "Светловодская улица",
    "ua": "Світловодська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Светлогорская улица",
    "ua": "Світлогірська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Светлодолинский переулок",
    "ua": "Світлодолинський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Световой переулок",
    "ua": "Світловий провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Свирский переулок",
    "ua": "Свірський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Свободы улица",
    "ua": "Свободи вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Севастопольская улица",
    "ua": "Севастопольська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Северная улица",
    "ua": "Північна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Северное шоссе",
    "ua": "Північне шоссе",
    "district": "Заводский район, Ленинский район",
    "old": ""
  },
  {
    "ru": "Северокольцевая улица",
    "ua": "Північнокільцева вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Седова улица",
    "ua": "Сєдова вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Сельская улица",
    "ua": "Сільська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Семафорная улица",
    "ua": "Семафорна вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Семашко улица",
    "ua": "Семашка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Симиренко улица",
    "ua": "Симиренка вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сенная улица",
    "ua": "Сінна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Серафимовича улица",
    "ua": "Серафимовича вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Сергея Королёва улица",
    "ua": "Сергія Корольова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сергея Тюленина улица",
    "ua": "Сергія Тюленіна вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Серебристый переулок",
    "ua": "Срібний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Серова улица",
    "ua": "Сєрова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Серова переулок",
    "ua": "Сєрова провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Серпуховская улица",
    "ua": "Серпухівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Сеченова улица",
    "ua": "Сєченова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Сечевая улица",
    "ua": "Січова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Сибирская улица",
    "ua": "Сибірська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сивашская улица",
    "ua": "Сиваська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Силовая улица",
    "ua": "Силова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Симбирский переулок",
    "ua": "Симбірський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Симферопольский переулок",
    "ua": "Сімферопольський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Симфоническая улица",
    "ua": "Симфонічна вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Синельниковская улица",
    "ua": "Синельниківська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Сиреневая улица",
    "ua": "Бузкова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Скалистая улица",
    "ua": "Скеляста вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Скальная улица",
    "ua": "Скельна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сквозная улица",
    "ua": "Наскрізна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Скворцова улица",
    "ua": "Скворцова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Сковороды улица",
    "ua": "Сковороди вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Складская улица",
    "ua": "Складська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Скрябина улица",
    "ua": "Скрябіна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Скульптурная улица",
    "ua": "Скульптурна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Славгородская улица",
    "ua": "Славгородська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Славутича улица",
    "ua": "Славутича вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Славы улица",
    "ua": "Слави вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Славянская улица",
    "ua": "Слов'янська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Сланцевая улица",
    "ua": "Сланцева вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Смежный переулок",
    "ua": "Суміжний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Смоленская улица",
    "ua": "Смоленська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Снайперская улица",
    "ua": "Снайперська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Снежный переулок",
    "ua": "Сніжний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Советская улица",
    "ua": "Радянька вулиця",
    "district": "Жовтневый район",
    "old": "Пилипівська вулиця"
  },
  {
    "ru": "Советская площадь",
    "ua": "Радянський майдан",
    "district": "Жовтневый район",
    "old": "Університетський майдан"
  },
  {
    "ru": "Советский проспект",
    "ua": "Радянський проспект",
    "district": "Ленинский район",
    "old": "Преображенського проспект"
  },
  {
    "ru": "Совхозная улица",
    "ua": "Радгоспна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Соколиный переулок",
    "ua": "Соколиний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Солидарности улица",
    "ua": "Солідарності вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Солнечная улица",
    "ua": "Сонячна вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Соляной переулок",
    "ua": "Соляний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "40 лет Октября улица",
    "ua": "40 років Жовтня вулиця",
    "district": "Ленинский район",
    "old": "Катерини Рубчакової вулиця"
  },
  {
    "ru": "40-летия Победы проспект",
    "ua": "40-річчя Перемоги проспект",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "40 лет Советской Украины улица",
    "ua": "40 років Радянської України вулиця",
    "district": "Ленинский район, Орджоникидзевский район",
    "old": "Преображенського вулиця або Вегмана вулиця"
  },
  {
    "ru": "Сортировочная улица",
    "ua": "Сортувальна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сосновая улица",
    "ua": "Соснова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Сосюры улица",
    "ua": "Сосюри вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Софиевская улица",
    "ua": "Софіївська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Софьи Перовской улица",
    "ua": "Срфії Перовської вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Социалистическая улица",
    "ua": "Соціалістична вулиця",
    "district": "Заводский район",
    "old": "Успішна вулиця"
  },
  {
    "ru": "Сочинский переулок",
    "ua": "Сочинський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Союзная улица",
    "ua": "Союзна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Спартаковская улица",
    "ua": "Спартаківська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Средняя улица",
    "ua": "Середня вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ставропольский переулок",
    "ua": "Ставропольський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Стадионная улица",
    "ua": "Стадіонна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сталеваров улица",
    "ua": "Сталеварів вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Стальной переулок",
    "ua": "Стальний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Стальского улица",
    "ua": "Стальського вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Станиславского улица",
    "ua": "Станіславського вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Станционная улица",
    "ua": "Станційна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Стасова улица",
    "ua": "Стасова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Стартовая улица",
    "ua": "Стартова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Степана Разина улица",
    "ua": "Степана Разіна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Степная улица",
    "ua": "Степова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Стешенко улица",
    "ua": "Стешенка вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Совхозный переулок",
    "ua": "Радгоспний провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Стефанова улица",
    "ua": "Стефанова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Столетова улица",
    "ua": "Столєтова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Столярная улица",
    "ua": "Столярна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Сторожевой переулок",
    "ua": "Сторожевий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Стратосферная улица",
    "ua": "Стратосферна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Стрелецкий переулок",
    "ua": "Стрілецький провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Стрелковый переулок",
    "ua": "Стрілковий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Стрельникова улица",
    "ua": "Стрельникова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Студенческая улица",
    "ua": "Студентська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Суворова улица",
    "ua": "Суворова вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Сулимы улица",
    "ua": "Сулими вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Сумская улица",
    "ua": "Сумська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Сурикова улица",
    "ua": "Сурикова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сурикова переулок",
    "ua": "Сурикова провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сусанина улица",
    "ua": "Сусаніна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сушильный переулок",
    "ua": "Сушильний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сухая улица",
    "ua": "Суха вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Сухая Балка улица",
    "ua": "Суха Балка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Счастливая улица",
    "ua": "Щаслива вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Сытова улица",
    "ua": "Ситова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Строителей бульвар",
    "ua": "Будівельників бульвар",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Табачный переулок",
    "ua": "Тютюновий провулок",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Таврическая улица",
    "ua": "Таврійська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Таврический переулок",
    "ua": "Таврійський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Таганрогская улица",
    "ua": "Таганрозька вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Таганская улица",
    "ua": "Таганська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Тактическая улица",
    "ua": "Тактична вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Талалихина улица",
    "ua": "Талаліхіна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Таллиннский переулок",
    "ua": "Талліннський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Таманская улица",
    "ua": "Таманська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Тамбовская улица",
    "ua": "Тамбовька вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Танкистов улица",
    "ua": "Танкістів вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Тараса Бульбы улица",
    "ua": "Тарасса Бульби вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Тбилисская улица",
    "ua": "Тбіліська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Тверская улица",
    "ua": "Тверська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Театральная улица",
    "ua": "Театральна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Театральный проезд",
    "ua": "Театральний проїзд",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Текстильный переулок",
    "ua": "Текстильний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Телеграфная улица",
    "ua": "Телеграфна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Тельмана улица",
    "ua": "Тельмана вулиця",
    "district": "Шевченковский район",
    "old": "Героїв Дніпра вулиця"
  },
  {
    "ru": "Тенистый переулок",
    "ua": "Тінистий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Теннисная улица",
    "ua": "Тенісна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Тепличная улица",
    "ua": "Теплична вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Тепличный переулок",
    "ua": "Тепличний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тепловая улица",
    "ua": "Теплова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Теплостроевская улица",
    "ua": "Теплобудівська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Теплоходная улица",
    "ua": "Теплохідна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Терешковой улица",
    "ua": "Терешкової вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Терновский улица",
    "ua": "Терновська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Тернопольская улица",
    "ua": "Тернопільська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тесленко улица",
    "ua": "Тесленка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Техническая улица",
    "ua": "Технічна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Технический переулок",
    "ua": "Технічний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тимирязева улица",
    "ua": "Тимірязєва вулиця",
    "district": "Жовтневый район, Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тимошенка улица",
    "ua": "Тимошенка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тимуровская улица",
    "ua": "Тимурівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Типографская улица",
    "ua": "Типографська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Тиражная улица",
    "ua": "Тиражна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Тираспольский переулок",
    "ua": "Тираспольський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Титановый переулок",
    "ua": "Титановий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Титова улица",
    "ua": "Титова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Тихий переулок",
    "ua": "Тихий провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Тобольская улица",
    "ua": "Тобольська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Товарищеская улица",
    "ua": "Товариська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Толбухина улица",
    "ua": "Толбухіна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Толстого улица",
    "ua": "Толстого вулиця",
    "district": "Орджоникидзевский район, Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тольятти улица",
    "ua": "Тольятті вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Томаковская улица",
    "ua": "Томаківська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Томский переулок",
    "ua": "Томський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тоннельная улица",
    "ua": "Тонельна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тополина улица",
    "ua": "Тополіна вулицяя",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Тракторная улица",
    "ua": "Тракторна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Транспортная улица",
    "ua": "Транспортна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Трансформаторна улица",
    "ua": "Трансформаторна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Трегубенка улица",
    "ua": "Трегубенка вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Трегубова улица",
    "ua": "Трегубова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Третьей Пятилетки улица",
    "ua": "Третьої П'ятирічки",
    "district": "Ленинский район",
    "old": "Богдана Ступки вулиця"
  },
  {
    "ru": "Трипольская улица",
    "ua": "Трипільська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Троицкий переулок",
    "ua": "Троїцький провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Троллейбусная улица",
    "ua": "Тролейбусна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Трубный переулок",
    "ua": "Трубний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Трудовая улица",
    "ua": "Трудова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Трясило улица",
    "ua": "Трясила вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Тульская улица",
    "ua": "Тульська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Тупиковый переулок",
    "ua": "Тупиковий провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Турбинная улица",
    "ua": "Турбінна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Тургенева улица",
    "ua": "Тургенєва вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Туристский переулок",
    "ua": "Туристська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Тухачевского улица",
    "ua": "Тухачевського вулиця",
    "district": "Шевченковский район",
    "old": "Квітки-Основ'яненко вулиця"
  },
  {
    "ru": "Тушинская улица",
    "ua": "Тушинська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Тычины улица",
    "ua": "Тичини вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Углегорская улица",
    "ua": "Вуглегірська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ударная улица",
    "ua": "Ударна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Ударников улица",
    "ua": "Ударників вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ужгородская улица",
    "ua": "Ужгородська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Узбекистанская улица",
    "ua": "Узбекистанська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Узкий переулок",
    "ua": "Вузький провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Узкоколейная улица",
    "ua": "Вузькоколійна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Узловая улица",
    "ua": "Вузлова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Украинская улица",
    "ua": "Українська вулиця",
    "district": "Жовтневый район, Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ульянова улица",
    "ua": "Ульянова вулиця",
    "district": "Ленинский район",
    "old": "Грушевського вулиця"
  },
  {
    "ru": "Уманская улица",
    "ua": "Уманська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Упорный переулок",
    "ua": "Упорний провулок",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Уральская улица",
    "ua": "Уральська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Урицкого улица",
    "ua": "Урицького вулиця",
    "district": "Коммунарский район",
    "old": "Сімейна вулиця"
  },
  {
    "ru": "Урожайная улица",
    "ua": "Врожайна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Усадебный улица",
    "ua": "Садибна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Уфимский переулок",
    "ua": "Уфімька вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Учительская улица",
    "ua": "Вчительська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Фабричная улица",
    "ua": "Фабрична вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Фабричный переулок",
    "ua": "Фабричний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Февральский переулок",
    "ua": "Лютнева провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Фадеева улица",
    "ua": "Фадєєва вулиця",
    "district": "Ленинский район",
    "old": "Діка вулиця"
  },
  {
    "ru": "Федьковича улица",
    "ua": "Федьковича вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Феодосийская улица",
    "ua": "Феодосійська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Ферганская улица",
    "ua": "Ферганська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ферросплавная улица",
    "ua": "Феросплавна вулиця",
    "district": "Ленинский район, Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Фестивальная улица",
    "ua": "Фестивальна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Физкультурная улица",
    "ua": "Фізкультурна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Фильтровая улица",
    "ua": "Фільтрова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Финальная улица",
    "ua": "Фінальна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Финансовая улица",
    "ua": "Фінансова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Флотский переулок",
    "ua": "Флотський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Фонвизина улица",
    "ua": "Фонвізіна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Фонтанная улица",
    "ua": "Фонтанна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Франко улица",
    "ua": "Франка вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Фрезерная улица",
    "ua": "Фрезерна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Фронтовой переулок",
    "ua": "Фронтовий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Фруктовая улица",
    "ua": "Фруктова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Фрунзе улица",
    "ua": "Фрунзе вулиця",
    "district": "Жовтневый район",
    "old": "Тепла вулиця"
  },
  {
    "ru": "Фундаментальная улица",
    "ua": "Фундаментальна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Фурманова улица",
    "ua": "Фурманова вулиця",
    "district": "Шевченковский район",
    "old": "Леся Курбаса вулиця"
  },
  {
    "ru": "Футбольная улица",
    "ua": "Футбольна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Фучика Юлиуса улица",
    "ua": "Фучика Юліуса вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Фюзеляжная улица",
    "ua": "Фюзеляжна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Хакасская улица",
    "ua": "Хакаська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Халтурина улица",
    "ua": "Халтуріна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Харьковская улица",
    "ua": "Харківська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Хасанская улица",
    "ua": "Хасанська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Хвойный переулок",
    "ua": "Хвойний провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Хворостная улица",
    "ua": "Хворостянська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Херсонский переулок",
    "ua": "Херсонський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Хлебная улица",
    "ua": "Хлібна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Хозяйственная улица",
    "ua": "Господарська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Хороводная улица",
    "ua": "Хороводна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Хрустальный переулок",
    "ua": "Кришталевий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Хортицкое шоссе",
    "ua": "Хортицьке шосе",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Цветочный переулок",
    "ua": "Квітковий провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Цветочная улица",
    "ua": "Квіткова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Целинная улица",
    "ua": "Цілинна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Центральная улица",
    "ua": "Центральна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Центральный бульвар",
    "ua": "Центральний бульвар",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Цимлянская улица",
    "ua": "Цимлянська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Циолковского улица",
    "ua": "Ціолковського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Цитрусовая улица",
    "ua": "Цитрусова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Цюрупы улица",
    "ua": "Цюрупи вулиця",
    "district": "Шевченковский район",
    "old": "Маковського вулиця"
  },
  {
    "ru": "Чайковского улица",
    "ua": "Чайковського вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Чапаева улица",
    "ua": "Чапаєва вулиця",
    "district": "Жовтневый район, Коммунарский район",
    "old": "Ласточкіна вулиця"
  },
  {
    "ru": "Чаривная улица",
    "ua": "Чарівна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Чекистов сквер",
    "ua": "Чекістів сквер",
    "district": "Александровский район",
    "old": "Платонівський сквер"
  },
  {
    "ru": "Чекистов улица",
    "ua": "Чекістів вулиця",
    "district": "Жовтневый район",
    "old": "Троїцька вулиця"
  },
  {
    "ru": "Челюскинцев улица",
    "ua": "Челюскінців вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Челябинская улица",
    "ua": "Челябінська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Чернозаводская улица",
    "ua": "Червонозаводська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Червоної Кінноти улица",
    "ua": "Червоної Кінноти вулиця",
    "district": "Ленинский район",
    "old": "Івана Гутника-Залужного вулиця"
  },
  {
    "ru": "Червоноказачья улица",
    "ua": "Червонокозача вулиця",
    "district": "Жовтневый район",
    "old": ""
  },
  {
    "ru": "Червонополянская улица",
    "ua": "Червонополянська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Червонопрапорная улица",
    "ua": "Червонопрапорна вулиця",
    "district": "Шевченковский район",
    "old": "Луцького вулиця"
  },
  {
    "ru": "Черепичная улица",
    "ua": "Черепична вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Череповецкая улица",
    "ua": "Череповецька вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Черкасский переулок",
    "ua": "Черкаський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Черниговская улица",
    "ua": "Чернігівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Черновицкая улица",
    "ua": "Чернівецька вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Чернозёмная улица",
    "ua": "Чорноземна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Черноморская улица",
    "ua": "Чорноморська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Черняховского улица",
    "ua": "Черняховського вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Чернышевского улица",
    "ua": "Чернишевського вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Четырнадцатого Октября улица",
    "ua": "Чотирнадцятого Жовтня вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Чехова улица",
    "ua": "Чехова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Чистый переулок",
    "ua": "Чистий провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Читинская улица",
    "ua": "Читинська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Чичерина улица",
    "ua": "Чичеріна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Чкалова улица",
    "ua": "Чкалова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Чонгарская улица",
    "ua": "Чонгарська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Чубаря улица",
    "ua": "Чубаря вулиця",
    "district": "Орджоникидзевский район",
    "old": "Паркова вулиця"
  },
  {
    "ru": "Чугуевский переулок",
    "ua": "Чугуївська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Чугунная улица",
    "ua": "Чавунна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Чудова улица",
    "ua": "Чудова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Чуйский переулок",
    "ua": "Чуйський провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Чукотский переулок",
    "ua": "Чукотський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Чумаченко улица",
    "ua": "Чумаченка вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Чубанова улица",
    "ua": "Чубанова вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Шамотная улица",
    "ua": "Шамотна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Шаумяна улица",
    "ua": "Шаумяна вулиця",
    "district": "Орджоникидзевский район",
    "old": "Гетьманська вулиця"
  },
  {
    "ru": "Шахматная улица",
    "ua": "Шахова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Шахтинский переулок",
    "ua": "Шахтинський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Шевченко улица",
    "ua": "Шевченка вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Шевченковский переулок",
    "ua": "Шевченківський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Шевчука улица",
    "ua": "Шевчука вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Шепетовский переулок",
    "ua": "Шепетівський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "60-летия СССР площадь",
    "ua": "60-річчя СРСР площа",
    "district": "Ленинский район",
    "old": "Вінтера площа"
  },
  {
    "ru": "Широкий переулок",
    "ua": "Широкий провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Ширшова проезд",
    "ua": "Ширшова проїзд",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Шишкина улица",
    "ua": "Шишкіна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Шкирятова улица",
    "ua": "Шкірятова вулиця",
    "district": "Заводский район",
    "old": "Привітна вулиця"
  },
  {
    "ru": "Шламовая улица",
    "ua": "Шламова вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Шлюзовая улица",
    "ua": "Шлюзова вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Штабная улица",
    "ua": "Штабна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Штурманский переулок",
    "ua": "Штурманський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Штурмовая улица",
    "ua": "Штурмова вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Шушенская улица",
    "ua": "Шушенська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Шевченко бульвар",
    "ua": "Шевченка бульвар",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Щаденко улица",
    "ua": "Щаденко вулиця",
    "district": "Ленинский район",
    "old": "Нібура вулиця"
  },
  {
    "ru": "Щорса улица",
    "ua": "Щорса вулиця",
    "district": "Шевченковский район",
    "old": "Духовченка вулиця"
  },
  {
    "ru": "Щукина улица",
    "ua": "Щукіна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Экономический переулок",
    "ua": "Економічний провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Экскаваторная улица",
    "ua": "Екскаваторна вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Экспрессорная улица",
    "ua": "Експресівська вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Элеваторная улица",
    "ua": "Елеваторна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Электрическая улица",
    "ua": "Електрична вулиця",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Электровозная улица",
    "ua": "Електровозна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Электрозаводская улица",
    "ua": "Електрозаводська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Электролизная улица",
    "ua": "Електролізна вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Энгельса улица",
    "ua": "Фрідріха Енгельса вулиця",
    "district": "Коммунарский район",
    "old": "Освітня вулиця"
  },
  {
    "ru": "Энергомеханическая улица",
    "ua": "Енергомеханічна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Энергетическая улица",
    "ua": "Енергетична вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Энтузиастов улица",
    "ua": "Ентузіастів вулиця",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Эпроновская улица",
    "ua": "Епронівська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Эстонская улица",
    "ua": "Естонська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Этюдная улица",
    "ua": "Етюдна вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Юбилейная улица",
    "ua": "Ювілейна вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Юбилейный проспект",
    "ua": "Ювілейний проспект",
    "district": "Хортицкий район",
    "old": ""
  },
  {
    "ru": "Южное шоссе",
    "ua": "Південне шосе",
    "district": "Заводский район, Ленинский район",
    "old": ""
  },
  {
    "ru": "Южноукраинская улица",
    "ua": "Південноукраїнська вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Южный переулок",
    "ua": "Південний провулок",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Юннатов улица",
    "ua": "Юнатів вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Юности улица",
    "ua": "Юності вулиця",
    "district": "Коммунарский район, Шевченковский район",
    "old": ""
  },
  {
    "ru": "Юрьевский переулок",
    "ua": "Юр'ївський провулок",
    "district": "Заводский район",
    "old": ""
  },
  {
    "ru": "Юлиуса Фучика улица",
    "ua": "Юліуса Фучика вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Яблочная улица",
    "ua": "Яблунева вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Яворницкого улица",
    "ua": "Дмитра Яворницького вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Яворный переулок",
    "ua": "Явірний провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Ягодный переулок",
    "ua": "Ягідний провулок",
    "district": "Александровский район",
    "old": ""
  },
  {
    "ru": "Якира переулок",
    "ua": "Якіра провулок",
    "district": "Заводский район",
    "old": "Весняний провулок"
  },
  {
    "ru": "Якутский переулок",
    "ua": "Якутський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ялтинская улица",
    "ua": "Ялтинська вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Январский переулок",
    "ua": "Січневий провулок",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Янтарная улица",
    "ua": "Бурштинова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ямской переулок",
    "ua": "Ямський провулок",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Яровая улица",
    "ua": "Ярова вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ярославская улица",
    "ua": "Ярославська вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Ясельная улица",
    "ua": "Ясельна вулиця",
    "district": "Коммунарский район",
    "old": ""
  },
  {
    "ru": "Яскравая улица",
    "ua": "Яскрава вулиця",
    "district": "Ленинский район",
    "old": ""
  },
  {
    "ru": "Ясногорская улица",
    "ua": "Ясногірська вулиця",
    "district": "Шевченковский район",
    "old": ""
  },
  {
    "ru": "Ясный переулок",
    "ua": "Ясний провулок",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Яценко улица",
    "ua": "Яценко вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  },
  {
    "ru": "Якова Новицкого улица",
    "ua": "Якова Новицького вулиця",
    "district": "Орджоникидзевский район",
    "old": ""
  }
]